src/Catalogs/РелизыТехнологическойПлатформы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РелизыТехнологическойПлатформы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипCOMСоединителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыCOMСоединителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/РелизыТехнологическойПлатформы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог платформы";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.Каталог;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		
		ТекущийКаталог = СокрЛП(ДиалогВыбораКаталога.Каталог);
		ТекущийКаталог = ?(Прав(ТекущийКаталог, 1) = "\", ТекущийКаталог, ТекущийКаталог + "\");
		ИсполняемыйФайлПлатформы = Новый Файл(ТекущийКаталог + ЗадачиНаСервере.ПолучитьИмяИсполняемогоФайлаПлатформы());
		
		Если ИсполняемыйФайлПлатформы.Существует() Тогда 
			
			ЭтаФорма.Объект.Каталог = ТекущийКаталог;		
			ЭтаФорма.ОбновитьОтображениеДанных();
			ЭтаФорма.Модифицированность = Истина;
		
			КаталогНачалоВыбораНаСервере();
			
		Иначе
			
			ОбщегоНазначенияСервер.ВывестиСообщение("В указанном каталоге не найден исполняемый файл платформы " + ЗадачиНаСервере.ПолучитьИмяИсполняемогоФайлаПлатформы());
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
//
//
Процедура КаталогНачалоВыбораНаСервере()
	
	ЭтаФорма.Объект.Наименование = Справочники.РелизыТехнологическойПлатформы.ВыделитьНомерРелизаИзКаталогаПлатформы(ЭтаФорма.Объект.Каталог);
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Наименование) Тогда
		ЭтаФорма.Объект.ТипCOMСоединителя = Справочники.РелизыТехнологическойПлатформы.ОпределитьТипCOMСоединителяПоНомеруПлатформы(ЭтаФорма.Объект.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.Каталог);
КонецПроцедуры
